Autodesk.Revit.DB.FabricationServiceButton.GetConditionUpperValue(System.Int32)
Gets the condition upper value (valid if less) for a given condition index.
condition:
The condition index.
Returns:
The condition upper value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionLowerValue(System.Int32)
Gets the condition lower value (valid if greater or equal) for a given condition index.
condition:
The condition index.
Returns:
The condition lower value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016